Revit 2027 API
SweptBlend.TopSketch Property
The top profile sketch of the swept blend.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch TopSketch { get; }
Public ReadOnly Property TopSketch As Sketch
	Get
public:
property Sketch^ TopSketch {
	Sketch^ get ();
}
member TopSketch : Sketch with get
Property Value
Sketch
Remarks
If the top profile is based on a family symbol, this property is null.
See Also
Reference
SweptBlend Class
Autodesk.Revit.DB Namespace